packages/fxa-auth-server/test/local/payments/fixtures/paypal/transaction_search_success.json

{
  "TIMESTAMP": "2021-02-11T18:15:12Z",
  "CORRELATIONID": "89f9bb2201990",
  "ACK": "Success",
  "VERSION": "204",
  "BUILD": "55101542",
  "L": [
    {
      "TIMESTAMP": "2021-02-11T17:38:28Z",
      "TIMEZONE": "GMT",
      "TYPE": "Payment",
      "EMAIL": "sb-ufoot5037790@personal.example.com",
      "NAME": "John Doe",
      "TRANSACTIONID": "2TA09271XC591854A",
      "STATUS": "Under Review",
      "AMT": "5.99",
      "CURRENCYCODE": "USD",
      "FEEAMT": "-0.47",
      "NETAMT": "5.52"
    },
    {
      "TIMESTAMP": "2021-02-11T17:38:23Z",
      "TIMEZONE": "GMT",
      "TYPE": "Payment",
      "EMAIL": "sb-ufoot5037790@personal.example.com",
      "NAME": "John Doe",
      "TRANSACTIONID": "7WW53923D67853628",
      "STATUS": "Under Review",
      "AMT": "5.99",
      "CURRENCYCODE": "USD",
      "FEEAMT": "-0.47",
      "NETAMT": "5.52"
    },
    {
      "TIMESTAMP": "2021-02-11T17:31:05Z",
      "TIMEZONE": "GMT",
      "TYPE": "Payment",
      "EMAIL": "sb-ufoot5037790@personal.example.com",
      "NAME": "John Doe",
      "TRANSACTIONID": "22N88933SF2815829",
      "STATUS": "Under Review",
      "AMT": "5.99",
      "CURRENCYCODE": "USD",
      "FEEAMT": "-0.47",
      "NETAMT": "5.52"
    }
  ]
}
